Repository: Axrr44/Islamic-Library-App
Catalog: lib/languages/app_*.arb
Languages: ar, fr, nl, ru, tr, ur

# bukhari
source: Sahih al-Bukhari
ar: صحيح البخاري
ru: Сахих аль-Бухари
tr: Sahih al-Buhari
ur: صحیح البخاری

# muslim
source: Sahih Muslim
ar: صحيح مسلم
ru: Сахих Муслим
tr: Sahih Müslim
ur: صحیح مسلم

# dawud
source: Sunan Abi Dawud
ar: سنن أبي داود
ru: Сунан Аби Дауд
tr: Sünen Ebu Davud
ur: سنن ابو داؤد

# tirmidhi
source: Jami` at-Tirmidhi
ar: جامع الترمذي
ru: Джами` ат-Тирмизи
tr: Cami at-Tirmizi
ur: جامع ترمذی

# nasai
source: Sunan an-Nasa'i
ar: سنن النسائي
ru: Сунан ан-Насаи
tr: Sünen an-Nesai
ur: سنن نسائی

# majah
source: Sunan Ibn Majah
ar: سنن ابن ماجة
ru: Сунан Ибн Маджа
tr: Sünen İbn Mace
ur: سنن ابن ماجہ

# malik
source: Muwatta Malik
ar: موطأ مالك
ru: Муватта Малик
tr: Muvatta Malik
ur: موطا امام مالک

# ahmad
source: Musnad Ahmad
ar: مسند أحمد
ru: Муснад Ахмад
tr: Müsned Ahmed
ur: مسند احمد

# darimi
source: Sunan ad-Darimi
ar: سنن الدرامي
ru: Сунан ад-Дарими
tr: Sünen ad-Darimi
ur: سنن دارمی

# riyad
source: Riyad as-Salihin
ar: رياض الصالحين
ru: Рийад ас-Салихин
tr: Riyazü's-Salihin
ur: ریاض الصالحین

# bulugh
source: Bulugh al-Maram
ar: بلوغ المرام
ru: Булуг аль-Марам
tr: Buluğ el-Meram
ur: بلوغ المرام

# adab
source: Al-Adab Al-Mufrad
ar: الأدب المفرد
ru: Аль-Адаб Аль-Муфрад
tr: El-Edeb El-Müfred
ur: الادب المفرد

# forty_hadith_n
source: The Forty Hadith of al-Imam an-Nawawi
ar: الأربعون النووية
fr: Les Quarante Hadiths de l'Imam an-Nawawi
nl: De Veertig Hadith van al-Imam an-Nawawi
ru: Сорок хадисов имама ан-Навави
tr: İmam Nevevi'nin Kırk Hadisi
ur: امام نووی کے چالیس احادیث

source: Email
ar: البريد الإلكتروني
ru: Электронная почта
tr: E-posta
ur: ای میل

source: Password
ar: كلمة المرور
fr: Mot de passe
nl: Wachtwoord
ru: Пароль
tr: Şifre
ur: پاس ورڈ

source: Sign in
ar: تسجيل الدخول
fr: Se connecter
nl: Inloggen
ru: Войти
tr: Giriş yap
ur: سائن ان کریں

source: Forget password ?
ar: هل نسيت كلمة المرور ؟
fr: Mot de passe oublié?
nl: Wachtwoord vergeten?
ru: Забыли пароль?
tr: Şifrenizi mi unuttunuz?
ur: پاس ورڈ بھول گئے؟

# signInFG
source: Or
ar: او
fr: Ou
nl: Of
ru: Или
tr: Veya
ur: یا

source: Sign in with
ar: التسجيل في
fr: Se connecter avec
nl: Inloggen met
ru: Войти с помощью
tr: ile giriş yap
ur: کے ساتھ سائن ان کریں

source: Google
ar: جوجل
ur: گوگل

source: Sign up
ar: إنشاء حساب
fr: S'inscrire
nl: Aanmelden
ru: Зарегистрироваться
tr: Kaydol
ur: رجسٹر کریں

# dontHaveAccount
source: Don`t have an account
ar: لا املك حساب ؟
fr: Vous n'avez pas de compte?
nl: Heb je geen account?
ru: Нет аккаунта
tr: Hesabınız yok mu?
ur: کیا آپ کا اکاؤنٹ نہیں ہے؟

source: Full Name
ar: الاسم الكامل
fr: Nom complet
nl: Volledige naam
ru: Полное имя
tr: Tam Adı
ur: پورا نام

source: Confirm Password
ar: تأكيد كلمة المرور
fr: Confirmer le mot de passe
nl: Bevestig wachtwoord
ru: Подтвердите пароль
tr: Şifreyi Onayla
ur: پاس ورڈ کی تصدیق کریں

# alreadyHave
source: Already have an account ?
ar: لدي بالفعل حساب ؟
fr: Vous avez déjà un compte?
nl: Heb je al een account?
ru: Уже есть аккаунт?
tr: Zaten bir hesabınız var mı?
ur: کیا آپ کا پہلے سے اکاؤنٹ ہے؟

source: Home
ar: الرئيسية
fr: Accueil
nl: Startpagina
ru: Главная
tr: Ana Sayfa
ur: ہوم

# quran
source: Qura`an
ar: القرآن الكريم
fr: Coran
nl: Koran
ru: Коран
tr: Kur'an
ur: قرآن

source: Hadiths
ar: الأحاديث
ru: Хадисы
tr: Hadisler
ur: احادیث

source: Tafseer
ar: التفاسير
fr: Tafsir
nl: Tafsier
ru: Тафсир
tr: Tefsir
ur: تفسیر

source: Search
ar: البحث
fr: Rechercher
nl: Zoeken
ru: Поиск
tr: Ara
ur: تلاش کریں

source: Favorites
ar: المفضلة
fr: Favoris
nl: Favorieten
ru: Избранное
tr: Favoriler
ur: پسندیدہ

source: Profile
ar: الملف الشخصي
fr: Profil
nl: Profiel
ru: Профиль
tr: Profil
ur: پروفائل

source: Languages
ar: اللغات
fr: Langues
nl: Talen
ru: Языки
tr: Diller
ur: زبانیں

source: Sign out
ar: تسحيل الخروج
fr: Se déconnecter
nl: Uitloggen
ru: Выйти
tr: Çıkış yap
ur: سائن آؤٹ کریں

source: Last read
ar: اخر قراءة
fr: Dernière lecture
nl: Laatst gelezen
ru: Последнее чтение
tr: Son okunan
ur: آخری پڑھا ہوا

source: Surah
ar: السورة
fr: Sourate
nl: Soera
ru: Сура
tr: Sure
ur: سورہ

source: Juz
ar: الأجزاء
ru: Джуз
tr: Cüz
ur: جز

source: Chapter
ar: الأبواب
fr: Chapitre
nl: Hoofdstuk
ru: Глава
tr: Bölüm
ur: باب

source: All
ar: الكل
fr: Tout
nl: Alle
ru: Все
tr: Tümü
ur: سب

# fseer
source: Tafsser
ar: التفسير
fr: Tafsir
nl: Tafsier
ru: Тафсир
tr: Tefsir
ur: تفسیر

source: Copy
ar: نسخ
fr: Copier
nl: Kopiëren
ru: Копировать
tr: Kopyala
ur: کاپی کریں

source: Share
ar: مشاركة
fr: Partager
nl: Delen
ru: Поделиться
tr: Paylaş
ur: شیئر کریں

source: Favorite
ar: تفضيل
fr: Favori
nl: Favoriet
ru: Избранное
tr: Favori
ur: پسندیدہ

source: Mark
ar: علامة
fr: Marquer
nl: Markeren
ru: Отметить
tr: İşaretle
ur: نشان لگائیں

source: Reset Password
ar: إعادة تعيين كلمة المرور
fr: Réinitialiser le mot de passe
nl: Wachtwoord opnieuw instellen
ru: Сбросить пароль
tr: Şifreyi sıfırla
ur: پاس ورڈ ری سیٹ کریں

# textOfResetPassword
source: Enter Your Email and we will send you a password rest link
ar: أدخل بريدك الإلكتروني وسنرسل لك رابط لإعادة تعيين كلمة المرور
fr: Entrez votre adresse e-mail et nous vous enverrons un lien pour réinitialiser votre mot de passe
nl: Voer uw e-mailadres in en we sturen u een link om uw wachtwoord opnieuw in te stellen
ru: Введите свою электронную почту, и мы отправим вам ссылку для сброса пароля
tr: E-postanızı girin, size bir şifre sıfırlama bağlantısı göndereceğiz
ur: اپنا ای میل درج کریں اور ہم آپ کو پاس ورڈ ری سیٹ کرنے کا لنک بھیجیں گے

source: Next
ar: التالي
fr: Suivant
nl: Volgende
ru: Далее
tr: İleri
ur: اگلا

source: Let`s go
ar: هيا بنا
fr: Allons-y
nl: Laten we gaan
ru: Поехали
tr: Haydi gidelim
ur: چلیں

# audio
source: Audios
ar: صوتيات
ru: Аудио
tr: Sesler
ur: آڈیو

# contentPage1
source: The application contains the entire Holy Quran
ar: يحتوي التطبيق على القرآن الكريم كاملا
fr: L'application contient le Saint Coran complet
nl: De applicatie bevat de volledige Heilige Koran
ru: Приложение содержит полный текст Священного Корана
tr: Uygulama, Kutsal Kur'an'ın tamamını içerir
ur: ایپ مکمل قرآن پاک کا متن شامل ہے

# contentPage2
source: An Islamic library with many books
ar: مكتبة إسلامية تضم العديد من الكتب
fr: Une bibliothèque islamique avec de nombreux livres
nl: Een islamitische bibliotheek met vele boeken
ru: Исламская библиотека с множеством книг
tr: Birçok kitap içeren İslami bir kütüphane
ur: اسلامی کتب خانہ متعدد کتب کے ساتھ

# contentPage3
source: tafseer of the Holy Qur’an for the nation’s leading scholars
ar: تفسير للقرآن الكريم لكبار علماء الأمة
fr: Tafsir du Saint Coran par les éminents savants de la nation
nl: Tafsier van de Heilige Koran door de vooraanstaande geleerden van de natie
ru: Тафсир Священного Корана от ведущих ученых
tr: Ülkenin önde gelen âlimlerinden Kutsal Kur'an'ın tefsiri
ur: قرآن پاک کی تفسیر مشہور علما کی طرف سے

# contentPage4
source: You can listen to the Holy Quran by different reciters
ar: يمكنك الاستماع للقرآن الكريم لمختلف القراء
fr: Vous pouvez écouter le Saint Coran par différents récitateurs
nl: U kunt luisteren naar de Heilige Koran door verschillende recitators
ru: Вы можете слушать Священный Коран с разными чтецами
tr: Farklı kıraatlarla Kutsal Kur'an'ı dinleyebilirsiniz
ur: آپ مختلف قراء سے قرآن پاک سن سکتے ہیں

# contentPage5
source: The application supports both Arabic and English languages
ar: يدعم التطبيق اللغتين العربية والإنجليزية
fr: L'application prend en charge les langues arabe et anglaise
nl: De applicatie ondersteunt zowel Arabische als Engelse talen
ru: Приложение поддерживает арабский и английский языки
tr: Uygulama hem Arapça hem de İngilizce dillerini destekler
ur: ایپ عربی اور انگریزی زبانوں کو سپورٹ کرتی ہے

# tafseerDescription
source: Many mufseer from Grand Ulema
ar: العديد من المفسرين من كبار العلماء
fr: Beaucoup de tafsir par les grands ulémas
nl: Veel mufasir van Grand Ulema
ru: Множество толкователей от Великих Улемов
tr: Büyük Ulemadan birçok müfessir
ur: بہت سارے علما کی تفسیریں

# homeSubTitle
source: My Lord, increase me in knowledge
ar: وَقُل رَّبِّ زِدْنِي عِلْمًا
fr: Mon Seigneur, augmente-moi en savoir
nl: Mijn Heer, vermeerder mij in kennis
ru: Господи, увеличь мои знания
tr: Rabbim, ilmimi artır
ur: اے میرے رب، میرے علم میں اضافہ فرما

# searchSubTitle
source: Search to get results faster
ar: ابحث للحصول على نتائج بشكل أسرع
fr: Recherchez pour obtenir des résultats plus rapidement
nl: Zoek om sneller resultaten te krijgen
ru: Ищите, чтобы получить результаты быстрее
tr: Sonuçları daha hızlı almak için arama yapın
ur: تلاش کریں اور جلدی سے نتائج حاصل کریں

# favoriteSubTitle
source: Favorite it and come back later
ar: فضل للعودة إليه لاحقا
fr: Favoriser et revenir plus tard
nl: Maak favoriet en kom later terug
ru: Добавьте в избранное и вернитесь позже
tr: Favori yap ve sonra tekrar gel
ur: پسندیدہ میں شامل کریں اور بعد میں واپس آئیں

# quranSubTitle
source: Read, rise and recite
ar: اقْرَأْ وَارْتَقِ وَرَتِّلْ
fr: Lire, monter et réciter
nl: Lees, stijg en reciteer
ru: Читайте, поднимайтесь и читайте
tr: Oku, yüksel ve tilavet et
ur: پڑھیں، اٹھیں اور پڑھیں

# hadithsSubTitle
source: whatever the Messenger commands you, then do it and whatever he forbids you, then avoid it
ar: وَما آتاكُمُ الرَّسُولُ فَخُذُوهُ وَما نَهاكُمْ عَنْهُ فَانْتَهُوا
fr: Ce que le Messager vous donne, prenez-le; et ce qu'il vous interdit, abstenez-vous en
nl: wat de Boodschapper u ook beveelt, doe het en wat hij u verbiedt, vermijd het dan
ru: что бы ни повелел вам Посланник, исполняйте, и чего он вам запретит, избегайте
tr: Peygamber ne emrederse yapın, neyi yasaklarsa kaçının
ur: جو رسول (صلی اللہ علیہ وآلہ وسلم) آپ کو دیں، لے لو، اور جس سے آپ کو منع کریں، اس سے بچو

# tafseerSubTitle
source: Then do they not reflect upon the Qur'an?
ar: أَفَلاَ يَتَدَبَّرُونَ الْقُرْآنَ
fr: Ne méditent-ils pas sur le Coran?
nl: Denken ze dan niet na over de Koran?
ru: Неужели они не размышляют над Кораном?
tr: Kur'an'ı düşünmezler mi?
ur: کیا وہ قرآن پر غور نہیں کرتے؟

# messageDialogPR
source: Password reset link sent! Check your email
ar: تم إرسال رابط إعادة تعيين كلمة المرور! تحقق من بريدك الالكتروني
fr: Lien de réinitialisation du mot de passe envoyé! Vérifiez votre e-mail
nl: Link voor het opnieuw instellen van wachtwoord verzonden! Controleer uw e-mail
ru: Ссылка для сброса пароля отправлена! Проверьте свою почту
tr: Şifre sıfırlama bağlantısı gönderildi! E-postanızı kontrol edin
ur: پاس ورڈ ری سیٹ کا لنک بھیج دیا گیا! اپنے ای میل کو چیک کریں

# warningSearch
source: If you are searching for a frequently repeated word, such as the word “Allah” this may take some time
ar: اذا كنت تبحث عن كلمة مكررة بكثرة مثل لفظ الجلالة "الله" من الممكن ان يستغرق هذا بعض من الوقت
fr: Si vous cherchez un mot souvent répété, comme le mot 'Allah', cela peut prendre du temps
nl: Als u zoekt naar een vaak herhaald woord, zoals het woord 'Allah', kan dit enige tijd duren
ru: Если вы ищете часто повторяющееся слово, такое как «Аллах», это может занять некоторое время
tr: “Allah” gibi sık tekrarlanan bir kelime arıyorsanız, bu biraz zaman alabilir
ur: اگر آپ 'اللہ' جیسے عام لفظ کی تلاش کر رہے ہیں، تو یہ کچھ وقت لے سکتا ہے

# reciter
source: Choose the reciter
ar: اختر القارئ
fr: Choisissez le réciteur
nl: Kies de recitator
ru: Выберите чтеца
tr: Kariyi seç
ur: قراء کا انتخاب کریں

# favoriteIt
source: Favorite
ar: تم التفضيل
fr: Favori
nl: Favoriet
ru: В избранное
tr: Favori yap
ur: پسندیدہ میں شامل کریں

source: Save
ar: تم الحفظ
fr: Enregistrer
nl: Opslaan
ru: Сохранить
tr: Kaydet
ur: محفوظ کریں

source: Skip
ar: تخطي
fr: Passer
nl: Overslaan
ru: Пропустить
tr: Geç
ur: چھوڑ دیں

# quranTutorial
source: The entire Holy Qur’an is divided into surahs and Juz in Hafs fonts. You can long click on any verse to tafseer it, share it, etc., and the advantage of listening to the Holy Qur’an is for many reciters.
ar: القران الكريم كاملا مقسم الى سور واجزاء بخط حفص ويمكن النقر مطولا على اي اية لتفسيرها او مشاركتها او ما الى ذلك وميزة الاستماع للقران الكريم بالعديد من القراء
fr: Le Saint Coran complet est divisé en sourates et Juz dans les polices Hafs. Vous pouvez appuyer longuement sur un verset pour le tafsir, le partager, etc., et la possibilité d'écouter le Saint Coran est disponible pour de nombreux récitateurs.
nl: De volledige Heilige Koran is verdeeld in soera's en Juz in Hafs-lettertypen. U kunt lang op een vers klikken om het te tafsieren, delen, enz., en de mogelijkheid om te luisteren naar de Heilige Koran is voor vele recitators.
ru: Весь Священный Коран разделен на суры и джузы в шрифте Хафс. Вы можете долго нажимать на любой аят, чтобы просмотреть тафсир, поделиться им и т.д., а также воспользоваться преимуществом прослушивания Священного Корана от многих чтецов.
tr: Kutsal Kur'an'ın tamamı, sureler ve cüzlere ayrılmıştır. Herhangi bir ayete uzun basarak tefsir edebilir, paylaşabilir vb. özelliklerden yararlanabilirsiniz. Birçok kâri tarafından Kutsal Kur'an'ı dinleme avantajına sahipsiniz.
ur: پورا قرآن پاک سورہ اور جز میں تقسیم ہے۔ آپ کسی بھی آیت پر لمبا دبا کر اس کی تفسیر دیکھ سکتے ہیں، شیئر کر سکتے ہیں، وغیرہ، اور مختلف قراء سے قرآن پاک سننے کا فائدہ بھی اٹھا سکتے ہیں۔

# hadithTutorial
source: An Islamic library containing the most famous Islamic books. Each book is divided into sections and the ability to search in each book
ar: مكتبة اسلامية تحتوي على اشهر الكتب الإسلامية كل كتاب مقسم الى أبواب وإمكانية البحث في كل كتاب
fr: Une bibliothèque islamique avec les livres islamiques les plus célèbres. Chaque livre est divisé en sections et la possibilité de rechercher dans chaque livre
nl: Een islamitische bibliotheek met de meest beroemde islamitische boeken. Elk boek is verdeeld in secties en de mogelijkheid om in elk boek te zoeken
ru: Исламская библиотека, содержащая самые известные исламские книги. Каждая книга разделена на разделы с возможностью поиска в каждой книге
tr: En ünlü İslami kitapları içeren bir İslami kütüphane. Her kitap bölümlere ayrılmış ve her kitapta arama yapma imkanı
ur: اسلامی کتب خانہ، جس میں مشہور اسلامی کتب شامل ہیں۔ ہر کتاب مختلف ابواب میں تقسیم ہے اور آپ ہر کتاب میں تلاش کر سکتے ہیں

# tafseerTutorial
source: Tafseer menu: You can choose the surah you want to interpret, then choose the misfir you want
ar: قائمة التفسير يمكنك اختيار السورة التي تريد تفسيرها ثم اختيار المسفر الذي تريده
fr: Menu Tafsir : Vous pouvez choisir la sourate que vous souhaitez interpréter puis choisir le mufasir que vous voulez
nl: Tafsiermenu: U kunt de soera kiezen die u wilt interpreteren en vervolgens de mufasir kiezen die u wilt
ru: Меню Тафсир: Вы можете выбрать суру, которую хотите истолковать, а затем выбрать тафсир, который хотите
tr: Tefsir menüsü: Yorumlamak istediğiniz sureyi seçebilir, ardından istediğiniz müfessiri seçebilirsiniz
ur: تفسیر مینو: آپ اس سورہ کا انتخاب کر سکتے ہیں جس کی آپ تفسیر کرنا چاہتے ہیں، پھر اس تفسیر کا انتخاب کریں جو آپ چاہتے ہیں

# searchTutorial
source: The search page enables you to search in hadiths, the Qur’an, or interpretation with the filtering feature
ar: صفحة البحث تمكنك من البحث في الأحاديث او القرآن او التفسير مع ميزة الفلترة
fr: La page de recherche vous permet de rechercher dans les hadiths, le Coran ou l'interprétation avec la fonction de filtre
nl: De zoekpagina stelt u in staat om in hadiths, de Koran of interpretatie te zoeken met de filterfunctie
ru: Страница поиска позволяет искать хадисы, Коран или толкования с функцией фильтрации
tr: Arama sayfası, hadislerde, Kur'an'da veya yorumlamalarda filtreleme özelliği ile arama yapmanızı sağlar
ur: تلاش صفحہ آپ کو احادیث، قرآن یا تفاسیر میں تلاش کرنے کی اجازت دیتا ہے جس میں فلٹرنگ کی خصوصیت ہے

# favoriteTutorial
source: You can favorite many things in the application and save them on this page to return to later with the filter feature
ar: يمكنك تفضيل العديد من الامور في التطبيق وحفظها في هذه الصفحة للعودة اليها لاحقا مع ميزة الفلترة
fr: Vous pouvez favoriser de nombreuses choses dans l'application et les enregistrer sur cette page pour y revenir plus tard avec la fonction de filtre
nl: U kunt veel dingen in de applicatie favoriet maken en ze op deze pagina opslaan om later op terug te komen met de filterfunctie
ru: Вы можете добавлять в избранное множество элементов в приложении и сохранять их на этой странице, чтобы вернуться к ним позже с функцией фильтрации
tr: Uygulamada birçok şeyi favori yapabilir ve bu sayfada daha sonra geri dönmek üzere saklayabilirsiniz, filtreleme özelliği ile
ur: آپ ایپ میں بہت سارے عناصر کو پسندیدہ میں شامل کر سکتے ہیں اور انہیں اس صفحے پر محفوظ کر سکتے ہیں تاکہ بعد میں ان پر واپس آئیں، فلٹرنگ کی خصوصیت کے ساتھ

# profileTutorial
source: This page contains your personal information, settings, and the ability to change your password
ar: تحتوي هذه الصفحة على معلوماتك الشخصية والإعدادات وإمكانية تغير كلمة المرور
fr: Cette page contient vos informations personnelles, paramètres et la possibilité de modifier votre mot de passe
nl: Deze pagina bevat uw persoonlijke informatie, instellingen en de mogelijkheid om uw wachtwoord te wijzigen
ru: Эта страница содержит вашу личную информацию, настройки и возможность изменить пароль
tr: Bu sayfa kişisel bilgilerinizi, ayarları ve şifre değiştirme imkanı içerir
ur: یہ صفحہ آپ کی ذاتی معلومات، ترتیبات اور پاس ورڈ تبدیل کرنے کی صلاحیت پر مشتمل ہے

source: “No last read
ar: لا يوجد اخر قراءة
fr: Pas de dernière lecture
nl: Geen laatst gelezen
ru: Нет последнего чтения
tr: Son okunan yok
ur: کوئی آخری پڑھا ہوا نہیں ہے

# warningFilterSearch
source: The default search is set to "Quraan". Please change it to "Tafaseer" or "ahadeeth” if you want to search those fields.
ar: البحث مضبوط على "القران", يرجى تغييره من الايقونة العلوية في حال اردت ان تبحث في التفاسيير أو الاحاديث
fr: La recherche par défaut est définie sur 'Coran'. Modifiez-la en 'Tafsirs' ou 'ahadith' si vous souhaitez rechercher ces domaines.
nl: De standaardzoekopdracht is ingesteld op 'Koran'. Wijzig dit naar 'Tafsiers' of 'ahadith' als u die velden wilt doorzoeken.
ru: По умолчанию поиск установлен на «Коран». Пожалуйста, измените его на «Тафсир» или «хадисы», если вы хотите искать в этих разделах.
tr: Varsayılan arama "Kur'an" olarak ayarlanmıştır. Bu alanlarda arama yapmak istiyorsanız lütfen "Tefsir" veya "Hadisler" olarak değiştirin.
ur: بذریعہ پہلے سے طے شدہ تلاش 'قرآن' پر سیٹ ہے۔ براہ کرم اسے 'تفسیر' یا 'احادیث' پر تبدیل کریں اگر آپ ان سیکشنز میں تلاش کرنا چاہتے ہیں۔

# signInDescription
source: Welcome to Islamic Library, sign up today and stay connected with the latest updates and features!
ar: أهلا بك بالمكتبة الإسلامية سجل اليوم وابقَ على اتصال بأحدث التحديثات والميزات
fr: Bienvenue à la Bibliothèque Islamique, inscrivez-vous dès aujourd'hui et restez à jour avec les dernières mises à jour et fonctionnalités!
nl: Welkom bij de Islamitische Bibliotheek, meld je vandaag nog aan en blijf op de hoogte van de nieuwste updates en functies!
ru: Добро пожаловать в Исламскую библиотеку, зарегистрируйтесь сегодня и оставайтесь на связи с последними обновлениями и функциями!
tr: İslam Kütüphanesine hoş geldiniz, bugün kaydolun ve en son güncellemeler ve özelliklerle bağlı kalın!
ur: اسلامی کتب خانہ میں خوش آمدید، آج ہی رجسٹر کریں اور تازہ ترین اپ ڈیٹس اور خصوصیات کے ساتھ رابطے میں رہیں!

source: Set
ar: تعيين
fr: Définir
nl: Instellen
ru: Установить
tr: Ayarla
ur: سیٹ کریں

source: Change password
ar: تغيير كلمة المرور
fr: Changer le mot de passe
nl: Wachtwoord wijzigen
ru: Изменить пароль
tr: Şifre değiştir
ur: پاس ورڈ تبدیل کریں

source: Delete account
ar: حذف الحساب
fr: Supprimer le compte
nl: Account verwijderen
ru: Удалить аккаунт
tr: Hesabı sil
ur: اکاؤنٹ ڈیلیٹ کریں

# noFavorite
source: No favorites found.
ar: لا يوجد محتوى المفضلة.
fr: Aucun favori trouvé.
nl: Geen favorieten gevonden.
ru: Избранное не найдено.
tr: Favori bulunamadı.
ur: کوئی پسندیدہ نہیں پایا گیا۔

# guest
source: Login as a guest
ar: الدخول كضيف
fr: Se connecter en tant qu'invité
nl: Inloggen als gast
ru: Войти как гость
tr: Misafir olarak giriş yap
ur: مہمان کے طور پر داخل ہوں

# privacyPolicy
source: By signing up you agree to
ar: من خلال التسجيل فإنك توافق على
fr: En vous inscrivant, vous acceptez
nl: Door je aan te melden ga je akkoord met
ru: Регистрируясь, вы соглашаетесь с
tr: Kaydolarak kabul etmiş oluyorsunuz
ur: رجسٹر کر کے، آپ متفق ہیں

# privacyPolicy2
source: the terms & conditions
ar: الشروط والأحكام
fr: les termes et conditions
nl: de algemene voorwaarden
ru: условиями и положениями
tr: şartlar ve koşullar
ur: شرائط و ضوابط

# privacyPolicy3
source: and our privacy policy
ar: وسياسة الخصوصية الخاصة بنا
fr: et notre politique de confidentialité
nl: en ons privacybeleid
ru: и нашей политикой конфиденциальности
tr: ve gizlilik politikamız
ur: اور ہماری رازداری کی پالیسی کے ساتھ

# confirmDeletionMessage
source: Are you sure to delete the account ?
ar: هل انت متأكد من حذف الحساب ؟
fr: Êtes-vous sûr de vouloir supprimer le compte?
nl: Weet je zeker dat je het account wilt verwijderen?
ru: Вы уверены, что хотите удалить аккаунт?
tr: Hesabı silmek istediğinizden emin misiniz?
ur: کیا آپ واقعی اکاؤنٹ کو حذف کرنا چاہتے ہیں؟

source: Cancel
ar: الغاء
fr: Annuler
nl: Annuleren
ru: Отмена
tr: İptal
ur: منسوخ کریں

source: Delete
ar: حذف
fr: Supprimer
nl: Verwijderen
ru: Удалить
tr: Sil
ur: حذف کریں

source: Confirm
ar: يتأكد
fr: Confirmer
nl: Bevestigen
ru: Подтвердить
tr: Onayla
ur: تصدیق کریں

# reEnterPassword
source: Re-enter your password
ar: أعد إدخال كلمة المرور
fr: Ré-entrez votre mot de passe
nl: Voer uw wachtwoord opnieuw in
ru: Введите пароль еще раз
tr: Şifrenizi yeniden girin
ur: پاس ورڈ دوبارہ درج کریں

# guestMessage
source: You have logged in as a guest. If you would like to benefit from this menu, log in
ar: لقد قمت بالدخول كضيف اذا اردت الاستفادة من هذه القائمة قم بتسجيل الدخول
fr: Vous êtes connecté en tant qu'invité. Si vous souhaitez profiter de ce menu, veuillez vous connecter
nl: U bent ingelogd als gast. Als u wilt profiteren van dit menu, log dan in
ru: Вы вошли как гость. Если вы хотите воспользоваться этим меню, войдите в систему
tr: Misafir olarak giriş yaptınız. Bu menüden yararlanmak istiyorsanız, giriş yapın
ur: آپ مہمان کے طور پر داخل ہوئے ہیں۔ اگر آپ اس مینو کا فائدہ اٹھانا چاہتے ہیں تو سائن ان کریں

source: Loading tafseer :
ar: تحميل التفسير :
fr: Chargement du Tafsir:
nl: Tafsier laden:
ru: Загрузка тафсира:
tr: Tefsir yükleniyor:
ur: تفسیر لوڈ ہو رہی ہے:

# descriptionOfTafseerLoading
source: Until the download is completed, use your time to seek forgiveness and glorify God
ar: حتى يتم الانتهاء من التحميل استغل وقتك بالاستغفار والتسبيح
fr: Jusqu'à ce que le téléchargement soit terminé, utilisez votre temps pour rechercher le pardon et glorifier Dieu
nl: Totdat het downloaden is voltooid, gebruik uw tijd om vergiffenis te zoeken en God te verheerlijken
ru: Пока загрузка не завершена, используйте это время для прощения и прославления Бога
tr: İndirme tamamlanana kadar, zamanınızı tövbe etmek ve Allah'ı yüceltmekle değerlendirin
ur: جب تک لوڈنگ مکمل نہیں ہوتی، اس وقت کو استغفار اور تسبیح میں گزاریں

source: Back
ar: الرجوع
fr: Retour
nl: Terug
ru: Назад
tr: Geri
ur: واپس

source: Shamail Muhammadiyah
ar: الشمائل المحمدية
ru: Шамаиль Мухаммадия
tr: Şemail-i Şerif
ur: شمائل محمدیہ

# titleOfPrivacyPolicy
source: Privacy Policy for The Islamic Library\nEffective Date: [5/31/2024]\n\n
ar: سياسة الخصوصية للمكتبة الإسلامية تاريخ السريان: [31/05/2024]
fr: Politique de confidentialité de la Bibliothèque Islamique Date d'entrée en vigueur : [31/05/2024]
nl: Privacybeleid voor de Islamitische Bibliotheek\nIngangsdatum: [31/05/2024]\n\n
ru: Политика конфиденциальности для Исламской библиотеки Дата вступления в силу: [31.05.2024]
tr: İslam Kütüphanesi için Gizlilik Politikası Yürürlük Tarihi: [31.05.2024]
ur: اسلامی کتب خانہ کے لیے رازداری کی پالیسی نافذ العمل کی تاریخ: [31.05.2024]
