Repository: Axrr44/Islamic-Library-App
Catalog: lib/languages/app_*.arb
Languages: ar, fr, nl, ru, tr, ur

# contentOfTerms
source: 1. Acceptance of Terms By downloading, accessing, or using The Islamic Library app ("the App"), you agree to be bound by these Terms of Use ("Terms"). If you do not agree to these Terms, please do not use the App. 2. Description of the App The Islamic Library provides users with access to the full text and audio of the Quran, various Tafseer books, and a full library of Hadiths. 3. Eligibility You must be at least 13 years old to use the App. By using the App, you represent and warrant that you meet this age requirement. 4. User Accounts To access certain features of the App, you may need to create an account. You agree to provide accurate and complete information when creating your account and to keep this information up to date. You are responsible for maintaining the confidentiality of your account and password and for restricting access to your device. 5. Use of the App You agree to use the App in accordance with these Terms and all applicable laws and regulations. You agree not to: ● Use the App for any unlawful purpose. ● Use the App in any way that could damage, disable, overburden, or impair the App or interfere with any other party's use of the App. ● Attempt to gain unauthorized access to any part of the App, other users' accounts, or any related systems or networks. ● Use any automated means to access the App or collect any information from the App. 6. Content All content provided in the App, including but not limited to the Quran text, audio, Tafseer, and Hadiths, is for informational and educational purposes only. While we strive to ensure the accuracy of the content, we do not guarantee that it is complete, accurate, or up-to-date. 7. Intellectual Property The App and its original content, features, and functionality are and will remain the exclusive property of [Your Company Name] and its licensors. The App is protected by copyright, trademark, and other laws of both the United States and foreign countries. Our trademarks and trade dress may not be used in connection with any product or service without the prior written consent of [Your Company Name]. 8. Termination We may terminate or suspend your account and bar access to the App immediately, without prior notice or liability, for any reason whatsoever, including without limitation if you breach the Terms. Upon termination, your right to use the App will immediately cease. 9. Limitation of Liability To the fullest extent permitted by applicable law, in no event shall [Your Company Name], its affiliates, directors, employees, or licensors be liable for any indirect, incidental, special, consequential, or punitive damages, including without limitation, loss of profits, data, use, goodwill, or other intangible losses, resulting from: ● Your use of or inability to use the App; ● Any unauthorized access to or use of our servers and/or any personal information stored therein; ● Any bugs, viruses, trojan horses, or the like that may be transmitted to or through our App by any third party; ● Any errors or omissions in any content or for any loss or damage incurred as a result of the use of any content posted, emailed, transmitted, or otherwise made available through the App. 10. Governing Law These Terms shall be governed and construed in accordance with the laws of [Your Country/State], without regard to its conflict of law provisions. 11. Changes to Terms We reserve the right, at our sole discretion, to modify or replace these Terms at any time. If a revision is material, we will try to provide at least 30 days' notice prior to any new terms taking effect. What constitutes a material change will be determined at our sole discretion. 12. Contact Us If you have any questions about these Terms, please contact us at: [Insert Contact Information]
ar: 1. قبول الشروط من خلال تنزيل تطبيق المكتبة الإسلامية أو الوصول إليه أو استخدامه ("التطبيق")، فإنك توافق على الالتزام بشروط الاستخدام هذه ("الشروط"). إذا كنت لا توافق على هذه الشروط، يرجى عدم استخدام التطبيق. 2. وصف التطبيق توفر المكتبة الإسلامية للمستخدمين إمكانية الوصول إلى النص الكامل والصوت للقرآن الكريم، وكتب التفسير المتنوعة، ومكتبة كاملة للأحاديث النبوية. 3. الأهلية يجب أن يكون عمرك 13 عامًا على الأقل حتى تتمكن من استخدام التطبيق. باستخدام التطبيق، فإنك تقر وتضمن أنك تستوفي هذا الشرط العمري. 4. حسابات المستخدمين للوصول إلى ميزات معينة في التطبيق، قد تحتاج إلى إنشاء حساب. أنت توافق على تقديم معلومات دقيقة وكاملة عند إنشاء حسابك وعلى إبقاء هذه المعلومات محدثة. أنت مسؤول عن الحفاظ على سرية حسابك وكلمة المرور وتقييد الوصول إلى جهازك. 5. استخدام التطبيق أنت توافق على استخدام التطبيق وفقًا لهذه الشروط وجميع القوانين واللوائح المعمول بها. أنت توافق على عدم: ● استخدام التطبيق لأي غرض غير قانوني. ● استخدم التطبيق بأي طريقة قد تؤدي إلى إتلاف التطبيق أو تعطيله أو إثقاله أو إضعافه أو التدخل في استخدام أي طرف آخر للتطبيق. ● محاولة الوصول غير المصرح به إلى أي جزء من التطبيق، أو حسابات المستخدمين الآخرين، أو أي أنظمة أو شبكات ذات صلة. ● استخدم أي وسيلة آلية للوصول إلى التطبيق أو جمع أي معلومات من التطبيق. 6. المحتوى جميع المحتوى المقدم في التطبيق، بما في ذلك على سبيل المثال لا الحصر، نص القرآن والصوت والتفسير والأحاديث، هو لأغراض إعلامية وتعليمية فقط. وبينما نسعى جاهدين لضمان دقة المحتوى، فإننا لا نضمن أنه كامل أو دقيق أو محدث. 7. الملكية الفكرية يعد التطبيق ومحتواه الأصلي وميزاته ووظائفه وسيظل ملكية حصرية لـ [اسم شركتك] والجهات المرخصة لها. التطبيق محمي بموجب حقوق الطبع والنشر والعلامات التجارية والقوانين الأخرى في كل من الولايات المتحدة والدول الأجنبية. لا يجوز استخدام علاماتنا التجارية ومظهرنا التجاري فيما يتعلق بأي منتج أو خدمة دون الحصول على موافقة كتابية مسبقة من [اسم شركتك]. 8. الإنهاء يجوز لنا إنهاء أو تعليق حسابك ومنع الوصول إلى التطبيق على الفور، دون إشعار مسبق أو مسؤولية، لأي سبب من الأسباب، بما في ذلك على سبيل المثال لا الحصر، إذا قمت بخرق الشروط. عند الإنهاء، سيتوقف حقك في استخدام التطبيق على الفور. 9. حدود المسؤولية إلى أقصى حد يسمح به القانون المعمول به، لن تتحمل [اسم شركتك] أو الشركات التابعة لها أو مديريها أو موظفيها أو المرخصين بأي حال من الأحوال المسؤولية عن أي أضرار غير مباشرة أو عرضية أو خاصة أو تبعية أو تأديبية، بما في ذلك، على سبيل المثال لا الحصر، فقدان الأرباح أو البيانات أو الاستخدام أو الشهرة أو غيرها من الخسائر غير الملموسة الناتجة عن: ● استخدامك أو عدم قدرتك على استخدام التطبيق؛ ● أي دخول أو استخدام غير مصرح به لخوادمنا و/أو أي معلومات شخصية مخزنة فيها؛ ● أي أخطاء أو فيروسات أو أحصنة طروادة أو ما شابه ذلك قد يتم نقلها إلى تطبيقنا أو من خلاله بواسطة أي طرف ثالث؛ ● أي أخطاء أو سهو في أي محتوى أو أي خسارة أو ضرر يتم تكبده نتيجة لاستخدام أي محتوى منشور أو مرسل عبر البريد الإلكتروني أو منقول أو متاح بطريقة أخرى من خلال التطبيق. 10. القانون الحاكم تخضع هذه الشروط وتفسر وفقًا لقوانين [بلدك/ولايتك]، بغض النظر عن تعارضها مع أحكام القانون. 11. تغييرات على الشروط نحن نحتفظ بالحق، وفقًا لتقديرنا الخاص، في تعديل أو استبدال هذه الشروط في أي وقت. إذا كانت المراجعة جوهرية، فسنحاول تقديم إشعار قبل 30 يومًا على الأقل من سريان أي شروط جديدة. سيتم تحديد ما يشكل تغييرًا جوهريًا وفقًا لتقديرنا الخاص. 12. اتصل بنا إذا كان لديك أي أسئلة حول هذه الشروط، يرجى الاتصال بنا على: [أدخل معلومات الاتصال]
fr: 1. Acceptation des conditions En téléchargeant, accédant ou utilisant l'application The Islamic Library ("l'Application"), vous acceptez d'être lié par ces Conditions d'utilisation ("Conditions"). Si vous n'acceptez pas ces Conditions, veuillez ne pas utiliser l'Application. 2. Description de l'Application The Islamic Library fournit aux utilisateurs un accès au texte complet et à l'audio du Coran, à divers livres de Tafseer et à une bibliothèque complète de Hadiths. 3. Admissibilité Vous devez avoir au moins 13 ans pour utiliser l'Application. En utilisant l'Application, vous déclarez et garantissez que vous remplissez cette condition d'âge. 4. Comptes d'utilisateur Pour accéder à certaines fonctionnalités de l'Application, vous devrez peut-être créer un compte. Vous acceptez de fournir des informations exactes et complètes lors de la création de votre compte et de maintenir ces informations à jour. Vous êtes responsable de la confidentialité de votre compte et de votre mot de passe, ainsi que de la restriction de l'accès à votre appareil. 5. Utilisation de l'Application Vous acceptez d'utiliser l'Application conformément à ces Conditions et à toutes les lois et réglementations applicables. Vous acceptez de ne pas : ● Utiliser l'Application à des fins illégales. ● Utiliser l'Application de manière à endommager, désactiver, surcharger ou altérer l'Application ou à interférer avec l'utilisation de l'Application par une autre partie. ● Tenter d'accéder sans autorisation à toute partie de l'Application, aux comptes d'autres utilisateurs ou à tout système ou réseau associé. ● Utiliser des moyens automatisés pour accéder à l'Application ou collecter des informations à partir de l'Application. 6. Contenu Tout le contenu fourni dans l'Application, y compris mais sans s'y limiter le texte du Coran, l'audio, le Tafseer et les Hadiths, est à des fins d'information et d'éducation uniquement. Bien que nous nous efforcions d'assurer l'exactitude du contenu, nous ne garantissons pas qu'il soit complet, exact ou à jour. 7. Propriété intellectuelle L'Application et son contenu original, ses fonctionnalités et ses fonctionnalités resteront la propriété exclusive de [Your Company Name] et de ses concédants. L'Application est protégée par des droits d'auteur, des marques de commerce et d'autres lois des États-Unis et des pays étrangers. Nos marques de commerce et notre habillage commercial ne peuvent pas être utilisés en relation avec un produit ou un service sans le consentement écrit préalable de [Your Company Name]. 8. Résiliation Nous pouvons résilier ou suspendre votre compte et interdire l'accès à l'Application immédiatement, sans préavis ni responsabilité, pour quelque raison que ce soit, y compris sans limitation si vous violez les Conditions. À la résiliation, votre droit d'utiliser l'Application cessera immédiatement. 9. Limitation de responsabilité Dans toute la mesure permise par la loi applicable, en aucun cas [Your Company Name], ses affiliés, administrateurs, employés ou concédants ne seront responsables de tout dommage indirect, incident, spécial, consécutif ou punitif, y compris sans limitation, perte de profits, de données, d'utilisation, de clientèle ou d'autres pertes immatérielles, résultant de : ● Votre utilisation ou incapacité à utiliser l'Application; ● Tout accès non autorisé à nos serveurs et/ou toute information personnelle stockée sur ceux-ci; ● Tout bogue, virus, cheval de Troie ou autre qui peut être transmis à ou via notre Application par un tiers; ● Toute erreur ou omission dans tout contenu ou pour toute perte ou dommage résultant de l'utilisation de tout contenu posté, envoyé par courriel, transmis ou autrement rendu disponible via l'Application. 10. Droit applicable Ces Conditions seront régies et interprétées conformément aux lois de [Your Country/State], sans égard à ses dispositions en matière de conflit de lois. 11. Modifications des Conditions Nous nous réservons le droit, à notre seule discrétion, de modifier ou de remplacer ces Conditions à tout moment. Si une révision est importante, nous essaierons de fournir un préavis d'au moins 30 jours avant que les nouvelles conditions n'entrent en vigueur. Ce qui constitue une modification importante sera déterminé à notre seule discrétion. 12. Contactez-nous Si vous avez des questions concernant ces Conditions, veuillez nous contacter à : [Insert Contact Information]
nl: 1. Aanvaarding van voorwaarden Door de Islamitische Bibliotheek-app te downloaden, te openen of te gebruiken ('de App'), gaat u akkoord met deze Gebruiksvoorwaarden ('Voorwaarden'). Als u niet akkoord gaat met deze Voorwaarden, gebruik de App dan niet. 2. Beschrijving van de App De Islamitische Bibliotheek biedt gebruikers toegang tot de volledige tekst en audio van de Koran, verschillende Tafseer-boeken en een volledige bibliotheek van Hadiths. 3. Geschiktheid U moet minstens 13 jaar oud zijn om de App te gebruiken. Door de App te gebruiken, verklaart en garandeert u dat u aan deze leeftijdseis voldoet. 4. Gebruikersaccounts Om toegang te krijgen tot bepaalde functies van de App, moet u mogelijk een account aanmaken. U stemt ermee in om nauwkeurige en volledige informatie te verstrekken bij het aanmaken van uw account en om deze informatie up-to-date te houden. U bent verantwoordelijk voor het handhaven van de vertrouwelijkheid van uw account en wachtwoord en voor het beperken van de toegang tot uw apparaat. 5. Gebruik van de App U stemt ermee in de App te gebruiken in overeenstemming met deze Voorwaarden en alle toepasselijke wetten en voorschriften. U stemt ermee in de App niet te gebruiken: ● Voor enig onwettig doel. ● Op een manier die de App kan beschadigen, uitschakelen, overbelasten of verstoren of het gebruik van de App door een andere partij kan verstoren. ● Om ongeautoriseerde toegang te krijgen tot enig deel van de App, andere gebruikersaccounts of gerelateerde systemen of netwerken. ● Om geautomatiseerde middelen te gebruiken om toegang te krijgen tot de App of om enige informatie van de App te verzamelen. 6. Inhoud Alle inhoud die in de App wordt verstrekt, inclusief maar niet beperkt tot de Koran-tekst, audio, Tafseer en Hadiths, is uitsluitend bedoeld voor informatieve en educatieve doeleinden. Hoewel we ernaar streven de nauwkeurigheid van de inhoud te waarborgen, garanderen we niet dat deze volledig, nauwkeurig of up-to-date is. 7. Intellectueel eigendom De App en de originele inhoud, functies en functionaliteit zijn en blijven het exclusieve eigendom van [Uw Bedrijfsnaam] en zijn licentiegevers. De App is beschermd door auteursrecht, handelsmerk en andere wetten van zowel de Verenigde Staten als buitenlandse landen. Onze handelsmerken en handelsmerken mogen niet worden gebruikt in verband met enig product of dienst zonder de voorafgaande schriftelijke toestemming van [Uw Bedrijfsnaam]. 8. Beëindiging We kunnen uw account beëindigen of opschorten en de toegang tot de App onmiddellijk, zonder voorafgaande kennisgeving of aansprakelijkheid, om welke reden dan ook, inclusief maar niet beperkt tot als u de Voorwaarden schendt. Bij beëindiging vervalt uw recht om de App te gebruiken onmiddellijk. 9. Beperking van aansprakelijkheid Voor zover toegestaan door toepasselijke wetgeving, zijn [Uw Bedrijfsnaam], zijn gelieerde ondernemingen, directeuren, werknemers of licentiegevers in geen geval aansprakelijk voor enige indirecte, incidentele, speciale, gevolg- of bestraffende schade, inclusief maar niet beperkt tot verlies van winst, gegevens, gebruik, goodwill of andere immateriële verliezen, voortvloeiend uit: ● Uw gebruik van of onvermogen om de App te gebruiken; ● Enige ongeautoriseerde toegang tot of gebruik van onze servers en/of enige persoonlijke informatie die daarin is opgeslagen; ● Enige bugs, virussen, trojaanse paarden of dergelijke die via de App door een derde partij kunnen worden overgebracht; ● Enige fouten of weglatingen in enige inhoud of voor enig verlies of schade ontstaan als gevolg van het gebruik van enige inhoud die is gepost, gemaild, verzonden of anderszins beschikbaar is gesteld via de App. 10. Toepasselijk recht Deze Voorwaarden worden beheerst en geïnterpreteerd in overeenstemming met de wetten van [Uw land/staat], zonder rekening te houden met de conflicterende wettelijke bepalingen. 11. Wijzigingen in de Voorwaarden We behouden ons het recht voor om deze Voorwaarden naar eigen goeddunken op elk moment te wijzigen of te vervangen. Als een wijziging wezenlijk is, zullen we proberen minstens 30 dagen van tevoren kennis te geven voordat nieuwe voorwaarden van kracht worden. Wat een wezenlijke wijziging vormt, wordt naar ons eigen goeddunken bepaald. 12. Contact opnemen Als u vragen heeft over deze Voorwaarden, kunt u contact met ons opnemen via: [Voeg contactgegevens in]
ru: 1. Принятие условий Скачивая, получая доступ или используя приложение Исламская библиотека ("Приложение"), вы соглашаетесь соблюдать эти Условия использования ("Условия"). Если вы не согласны с этими Условиями, пожалуйста, не используйте Приложение. 2. Описание Приложения Исламская библиотека предоставляет пользователям доступ к полному тексту и аудио Корана, различным книгам Тафсира и полной библиотеке Хадисов. 3. Право на использование Вам должно быть не менее 13 лет для использования Приложения. Используя Приложение, вы заявляете и гарантируете, что соответствуете этому возрастному требованию. 4. Пользовательские аккаунты Для доступа к определенным функциям Приложения вам может понадобиться создать аккаунт. Вы соглашаетесь предоставлять точную и полную информацию при создании аккаунта и поддерживать эту информацию в актуальном состоянии. Вы несете ответственность за сохранение конфиденциальности вашего аккаунта и пароля и за ограничение доступа к вашему устройству. 5. Использование Приложения Вы соглашаетесь использовать Приложение в соответствии с этими Условиями и всеми применимыми законами и правилами. Вы соглашаетесь не: ● Использовать Приложение для любых незаконных целей. ● Использовать Приложение таким образом, чтобы нанести ущерб, отключить, перегрузить или ухудшить работу Приложения или помешать использованию Приложения другими пользователями. ● Пытаться получить несанкционированный доступ к любой части Приложения, аккаунтам других пользователей или любым связанным системам или сетям. ● Использовать любые автоматизированные средства для доступа к Приложению или сбора любой информации из Приложения. 6. Содержание Все содержание, предоставленное в Приложении, включая, но не ограничиваясь текстом Корана, аудио, Тафсирами и Хадисами, предназначено только для информационных и образовательных целей. Мы стремимся обеспечить точность содержания, но не гарантируем его полноту, точность или актуальность. 7. Интеллектуальная собственность Приложение и его оригинальное содержание, функции и функциональность являются и останутся исключительной собственностью [Имя вашей компании] и его лицензиаров. Приложение защищено авторским правом, товарными знаками и другими законами как США, так и иностранных государств. Наши товарные знаки и торговое оформление не могут быть использованы в связи с любым продуктом или услугой без предварительного письменного согласия [Имя вашей компании]. 8. Прекращение Мы можем немедленно приостановить или прекратить ваш аккаунт и запретить доступ к Приложению без предварительного уведомления или ответственности по любой причине, включая, но не ограничиваясь, нарушение Условий. По прекращении действия, ваше право на использование Приложения немедленно прекращается. 9. Ограничение ответственности В максимальной степени, разрешенной применимым законодательством, [Имя вашей компании], его аффилиаты, директора, сотрудники или лицензиары не несут ответственности за любые косвенные, случайные, специальные, последующие или штрафные убытки, включая, но не ограничиваясь, потерю прибыли, данных, использования, доброй воли или других нематериальных потерь, возникающих из: ● Вашего использования или невозможности использования Приложения; ● Любого несанкционированного доступа или использования наших серверов и/или любой личной информации, хранящейся на них; ● Любых ошибок, вирусов, троянских коней или аналогичных вредоносных программ, которые могут быть переданы через наше Приложение третьими лицами; ● Любых ошибок или упущений в любом содержании или за любые потери или повреждения, возникающие в результате использования любого содержания, опубликованного, отправленного по электронной почте, переданного или иным образом предоставленного через Приложение. 10. Применимое право Эти Условия регулируются и толкуются в соответствии с законами [вашей страны/штата], без учета его конфликтов правовых положений. 11. Изменения условий Мы оставляем за собой право, по нашему усмотрению, изменять или заменять эти Условия в любое время. Если изменение является существенным, мы постараемся предоставить уведомление за 30 дней до вступления в силу новых условий. Что представляет собой существенное изменение, будет определено по нашему усмотрению. 12. Связаться с нами Если у вас есть вопросы по этим Условиям, пожалуйста, свяжитесь с нами по адресу: [Указать контактную информацию]
tr: 1. Şartların Kabulü İslam Kütüphanesi uygulamasını ("Uygulama") indirerek, erişerek veya kullanarak bu Kullanım Şartlarına ("Şartlar") bağlı kalmayı kabul edersiniz. Bu Şartları kabul etmiyorsanız, lütfen Uygulamayı kullanmayın. 2. Uygulamanın Tanımı İslam Kütüphanesi, kullanıcılara Kur'an'ın tam metni ve sesli versiyonlarına, çeşitli tefsir kitaplarına ve tam bir hadis kütüphanesine erişim sağlar. 3. Uygunluk Uygulamayı kullanmak için en az 13 yaşında olmalısınız. Uygulamayı kullanarak bu yaş gerekliliğini karşıladığınızı beyan ve garanti edersiniz. 4. Kullanıcı Hesapları Uygulamanın belirli özelliklerine erişmek için bir hesap oluşturmanız gerekebilir. Hesabınızı oluştururken doğru ve eksiksiz bilgi vermeyi ve bu bilgileri güncel tutmayı kabul edersiniz. Hesabınızın ve şifrenizin gizliliğini korumaktan ve cihazınıza erişimi sınırlamaktan siz sorumlusunuz. 5. Uygulamanın Kullanımı Uygulamayı bu Şartlara ve tüm geçerli yasalara ve düzenlemelere uygun olarak kullanmayı kabul edersiniz. Şunları yapmamayı kabul edersiniz: ● Uygulamayı herhangi bir yasa dışı amaç için kullanmak. ● Uygulamayı zarar verecek, devre dışı bırakacak, aşırı yükleyecek veya bozacak şekilde kullanmak ya da başka bir tarafın uygulamayı kullanmasına müdahale etmek. ● Uygulamanın herhangi bir bölümüne, diğer kullanıcıların hesaplarına veya ilgili sistem veya ağlara yetkisiz erişim sağlamaya çalışmak. ● Uygulamaya otomatik yollarla erişmek veya uygulamadan herhangi bir bilgi toplamak için herhangi bir otomatik araç kullanmak. 6. İçerik Uygulamada sağlanan tüm içerik, Kur'an metni, sesli, tefsir ve hadisler dahil ancak bunlarla sınırlı olmamak üzere, bilgi ve eğitim amaçlıdır. İçeriğin doğruluğunu sağlamak için çaba sarf etsek de, içeriğin tam, doğru veya güncel olduğunu garanti etmiyoruz. 7. Fikri Mülkiyet Uygulama ve orijinal içeriği, özellikleri ve işlevselliği [Şirket Adınız] ve lisans verenlerinin münhasır mülkiyetinde kalacaktır. Uygulama, hem Amerika Birleşik Devletleri hem de yabancı ülkelerin telif hakkı, ticari marka ve diğer yasaları ile korunmaktadır. Ticari markalarımız ve ticari elbiselerimiz, önceden yazılı iznimiz olmadan herhangi bir ürün veya hizmetle bağlantılı olarak kullanılamaz. 8. Fesih Hesabınızı derhal feshedebilir veya askıya alabilir ve herhangi bir nedenle, önceden bildirimde bulunmadan veya sorumluluk altına girmeden Uygulamaya erişimi yasaklayabiliriz, bu nedenler arasında Şartların ihlali de bulunmaktadır. Fesih durumunda, uygulamayı kullanma hakkınız derhal sona erer. 9. Sorumluluğun Sınırlandırılması Geçerli yasanın izin verdiği en geniş ölçüde, [Şirket Adınız], bağlı kuruluşları, yöneticileri, çalışanları veya lisans verenleri, doğrudan, dolaylı, tesadüfi, özel, sonuç olarak ortaya çıkan veya cezai zararlar dahil ancak bunlarla sınırlı olmamak üzere, kar kaybı, veri kaybı, kullanım kaybı, itibar kaybı veya diğer maddi olmayan kayıplardan sorumlu olmayacaktır: ● Uygulamayı kullanmanız veya kullanamamanız; ● Sunucularımıza yetkisiz erişim veya sunucularımızda depolanan herhangi bir kişisel bilginin yetkisiz kullanımı; ● Üçüncü bir tarafın uygulamamıza bulaştırabileceği herhangi bir böcek, virüs, truva atı veya benzeri; ● Uygulama aracılığıyla yayınlanan, e-posta ile gönderilen, iletilen veya başka bir şekilde kullanıma sunulan herhangi bir içerikteki hatalar veya eksiklikler veya herhangi bir içeriğin kullanımı sonucu meydana gelen herhangi bir kayıp veya zarar. 10. Geçerli Hukuk Bu Şartlar, yasa hükümleriyle çelişmeye bakılmaksızın, [Ülkeniz/Eyaletiniz] yasalarına tabi olacak ve ona göre yorumlanacaktır. 11. Şartlardaki Değişiklikler Bu Şartları kendi takdirimize bağlı olarak herhangi bir zamanda değiştirme veya değiştirme hakkını saklı tutarız. Eğer bir revizyon önemli ise, yeni şartların yürürlüğe girmesinden en az 30 gün önce bildirimde bulunmaya çalışacağız. Önemli bir değişikliğin ne olduğunu kendi takdirimize bağlı olarak belirleyeceğiz. 12. Bizimle İletişime Geçin Bu Şartlar hakkında herhangi bir sorunuz varsa, lütfen bizimle iletişime geçin: [İletişim Bilgilerini Ekleyin]
ur: 1. شرائط کی قبولیت آئیسلامک لائبریری ایپ ("ایپ") ڈاؤن لوڈ کرنے، رسائی حاصل کرنے یا استعمال کرنے سے، آپ ان شرائط کے مطابق باؤنڈ ہونے کے لیے متفق ہیں ("شرائط")۔ اگر آپ ان شرائط سے متفق نہیں ہیں تو براہ کرم ایپ کا استعمال نہ کریں۔ 2. ایپ کی تفصیلات آئیسلامک لائبریری صارفین کو قرآن کے مکمل متن اور آڈیو، مختلف تفسیر کتب، اور احادیث کتب کی مکمل لائبریری تک رسائی فراہم کرتا ہے۔ 3. اہلیت آپ کو ایپ استعمال کرنے کے لیے کم از کم 13 سال کا ہونا ضروری ہے۔ ایپ استعمال کرتے ہوئے، آپ اس عمری شرط کو پورا کرنے کا دعویٰ کرتے ہیں اور ضمانت دیتے ہیں کہ آپ اس عمری شرط کو پورا کرتے ہیں۔ 4. صارف کے اکاؤنٹس ایپ کی کچھ خصوصیات تک رسائی حاصل کرنے کے لیے، آپ کو اکاؤنٹ بنانا ہوسکتا ہے۔ آپ اپنے اکاؤنٹ بنانے کے وقت درست اور مکمل معلومات فراہم کرنے کے لیے متفق ہوتے ہیں اور اس معلومات کو تازہ رکھنے کے لیے ذمہ دار ہیں۔ آپ اپنے اکاؤنٹ اور پاس ورڈ کی رازداری کا خیال رکھنے اور اپنے ڈیوائس تک رسائی کو محدود کرنے کے لیے ذمہ دار ہیں۔ 5. ایپ کا استعمال آپ اس ایپ کا استعمال ان شرائط کے مطابق اور تمام لاگو قوانین اور ضوابط کے مطابق کریں گے۔ آپ اتنا نہیں کرنا چاہیں گے: ● ایپ کو کسی غیر قانونی مقصد کے لیے استعمال کریں۔ ● ایپ کو ایسے کسی طریقے سے استعمال نہ کریں جو ایپ کو نقصان پہنچا سکتا ہے، غیر فعال کر سکتا ہے، زیادہ بوجھ ڈال سکتا ہے یا دوسرے صارفین کے ایپ کے استعمال سے مداخلت کر سکتا ہے۔ ● ایپ کے کسی حصے تک غیر مجاز رسائی حاصل کرنے کی کوشش نہ کریں، دوسرے صارفین کے اکاؤنٹس، یا کسی متعلقہ نظامات یا نیٹ ورک کی مداخلت کریں۔ ● ایپ سے کوئی بھی خودکار طریقے سے رسائی حاصل کریں یا ایپ سے کوئی بھی معلومات جمع کریں۔ 6. مواد ایپ میں فراہم کردہ تمام مواد، قرآنی متن، آڈیو، تفسیر اور احادیث وغیرہ، صرف معلوماتی اور تعلیمی مقاصد کے لیے ہیں۔ ہم مواد کی درستی کو یقینی بنانے کی کوشش کرتے ہیں، لیکن ہم یہ یقین نہیں کرتے کہ یہ مکمل، درست یا تازہ ہے۔ 7. فکری ملکیت ایپ اور اس کی اصل مواد، خصوصیات، اور فعالیت باقاعدہ [آپ کی کمپنی کا نام] اور اس کے لائسنسر کی انحصاری ملکیت ہیں اور رہیں گی۔ ایپ کا حق نامہ، ٹریڈ مارک، اور دوسرے ملکوں کے قانونوں سے محفوظ ہے۔ ہماری ٹریڈ مارکس اور ٹریڈ ڈریس کو [آپ کی کمپنی کا نام] کی پیشگوئی کے بغیر کسی بھی پروڈکٹ یا خدمت کے ساتھ استعمال نہیں کیا جا سکتا۔ 8. ختم کرنا ہم آپ کے اکاؤنٹ کو ختم یا معطل کر سکتے ہیں اور ایپ تک رسائی کو فوری طور پر بند کر سکتے ہیں، پہلے کسی بھی اطلاع کے بغیر یا ذمہ داری کے بغیر، کسی بھی وجہ کے لیے، بشرطیکہ آپ شرائط کی خلاف ورزی کریں۔ ختم ہونے پر، آپ کا ایپ کا استعمال کا حق فوری طور پر ختم ہوجائے گا۔ 9. مسئلت کی حد لاگو قانون کے مطابق، کسی بھی صورت میں، کسی بھی غیر بطوری، اتفاقی، خاص یا سزائی نقصانات، زیادہ سے زیادہ مسئلت، ڈیٹا، استعمال، نیکی، یا دوسرے غیر محسوس نقصانات کے لیے، بغیر کسی متوسط، نتیجہ میں بغیر، ہماری مسئلت، اس کے متحدہ، ڈائریکٹرز، ملازمین، یا لائسنسر کی ذمہ داری نہیں ہوگی: ● آپ کے ایپ کا استعمال یا اس کا استعمال نہ ہونا؛ ● ہمارے سرورات کا کوئی بھی غیر مجاز رسائی یا استعمال یا ان میں ذخیرہ کردہ کسی بھی شخصی معلومات؛ ● کوئی بھی کیچڑ، وائرس، ٹروجن گھوڑا، یا ایسی کوئی شے جو کسی تیسرے طرف سے ہماری ایپ کو منتقل یا چلا سکتی ہوں؛ ● کوئی بھی غلطیاں یا خامیاں کسی بھی مواد میں یا کسی بھی مواد کے استعمال کی وجہ سے کسی بھی غیر محسوس نقصان کی حد میں ہوں۔ 10. قانون حکومت ان شرائط کو [آپ کے ملک/ریاست] کے قوانین کے مطابق حکمرانی اور ترجمہ کیا جائے گا، بغیر کسی تضاد کے قوانین کے۔ 11. شرائط میں تبدیلیاں ہم اپنی ایکلیت پر، اپنی مرضی کے مطابق، ان شرائط کو کسی بھی وقت ترمیم یا تبدیل کرنے کا حق محفوظ رکھتے ہیں۔ اگر کوئی ترمیم اہم ہو تو ہم کم از کم 30 دنوں کی مدت سے پہلے کسی بھی نئے شرائط کی اطلاع فراہم کرنے کی کوشش کریں گے۔ کون سی بات کسی اہم تبدیلی کو ظاہر کرتی ہے، یہ ہماری ایکلیت پر منحصر ہوگی۔ 12. ہم سے رابطہ کریں اگر آپ کو ان شرائط کے بارے میں کوئی سوال ہو، براہ کرم ہم سے رابطہ کریں: [رابطہ کی معلومات درج کریں]
