Repository: Axrr44/Islamic-Library-App
Catalog: lib/languages/app_*.arb
Languages: ar, fr, nl, ru, tr, ur

# contentOfPrivacyPolicy
source: 1. Introduction Welcome to The Islamic Library app. Your privacy is of utmost importance to us. This Privacy Policy outlines how we collect, use, and protect your information when you use our app. 2. Information We Collect We may collect the following types of information: ● Personal Information: If you register for an account, we may collect your name, email address, and other contact details. ● Usage Data: We collect information about how you use our app, including the pages you view, the features you use, and the actions you take. ● Device Information: We may collect information about your device, including the type, operating system, and unique device identifiers. 3. How We Use Your Information We use the information we collect for the following purposes: ● To provide and improve our app’s functionality and user experience. ● To communicate with you, including sending updates and notifications. ● To personalize your experience and provide content relevant to you. ● To analyze usage patterns and improve our app. 4. Sharing Your Information We do not share your personal information with third parties except in the following cases: ● With your consent. ● To comply with legal obligations. ● To protect and defend our rights and property. ● With service providers who perform services on our behalf (e.g., hosting providers, analytics services). 5. Data Security We implement appropriate technical and organizational measures to protect your data against unauthorized access, loss, or alteration. However, please be aware that no security measures are perfect or impenetrable. 6. Your Rights You have the following rights regarding your personal information: ● Access: You can request access to your personal information. ● Correction: You can request correction of inaccurate or incomplete information. ● Deletion: You can request the deletion of your personal information. ● Objection: You can object to the processing of your personal information. To exercise these rights, please contact us at [insert contact email]. 7. Third-Party Links Our app may contain links to third-party websites. We are not responsible for the privacy practices or content of these third-party sites. 8. Changes to This Privacy Policy We may update this Privacy Policy from time to time. We will notify you of any changes by posting the new Privacy Policy on this page. You are advised to review this Privacy Policy periodically for any changes. 9. Contact Us If you have any questions or concerns about this Privacy Policy, please contact us at: [Insert Contact Information] 10. Children's Privacy Our app is not intended for use by children under the age of 13. We do not knowingly collect personal information from children under 13. If you become aware that a child under 13 has provided us with personal information, please contact us so that we can take appropriate action.
ar: 1 المقدمة مرحبا بكم في تطبيق المكتبة الإسلامية. خصوصيتك أمر في غاية الأهمية بالنسبة لنا. توضح سياسة الخصوصية هذه كيفية جمع معلوماتك واستخدامها وحمايتها عند استخدام تطبيقنا. 2. المعلومات التي نجمعها قد نقوم بجمع الأنواع التالية من المعلومات: ● المعلومات الشخصية: إذا قمت بالتسجيل للحصول على حساب، فقد نقوم بجمع اسمك وعنوان بريدك الإلكتروني وتفاصيل الاتصال الأخرى. ● بيانات الاستخدام: نقوم بجمع معلومات حول كيفية استخدامك لتطبيقنا، بما في ذلك الصفحات التي تشاهدها والميزات التي تستخدمها والإجراءات التي تتخذها. ● معلومات الجهاز: قد نقوم بجمع معلومات حول جهازك، بما في ذلك النوع ونظام التشغيل ومعرفات الجهاز الفريدة. 3. كيف نستخدم معلوماتك نحن نستخدم المعلومات التي نجمعها للأغراض التالية: ● لتوفير وتحسين وظائف التطبيق لدينا وتجربة المستخدم. ● للتواصل معك، بما في ذلك إرسال التحديثات والإشعارات. ● لتخصيص تجربتك وتوفير المحتوى المناسب لك. ● لتحليل أنماط الاستخدام وتحسين التطبيق لدينا. 4. مشاركة معلوماتك نحن لا نشارك معلوماتك الشخصية مع أطراف ثالثة إلا في الحالات التالية: ● بموافقتك. ● للامتثال للالتزامات القانونية. ● لحماية حقوقنا وممتلكاتنا والدفاع عنها. ● مع مقدمي الخدمات الذين يقدمون الخدمات نيابة عنا (على سبيل المثال، مقدمو خدمات الاستضافة، وخدمات التحليلات). 5. أمن البيانات نحن ننفذ التدابير الفنية والتنظيمية المناسبة لحماية بياناتك من الوصول غير المصرح به أو الفقدان أو التغيير. ومع ذلك، يرجى العلم أنه لا توجد إجراءات أمنية مثالية أو غير قابلة للاختراق. 6. حقوقك لديك الحقوق التالية فيما يتعلق بمعلوماتك الشخصية: ● الوصول: يمكنك طلب الوصول إلى المعلومات الشخصية الخاصة بك. ● التصحيح: يمكنك طلب تصحيح المعلومات غير الدقيقة أو غير الكاملة. ● الحذف: يمكنك طلب حذف معلوماتك الشخصية. ● الاعتراض: يمكنك الاعتراض على معالجة معلوماتك الشخصية. لممارسة هذه الحقوق، يرجى الاتصال بنا على [أدخل البريد الإلكتروني للاتصال]. 7. روابط الطرف الثالث قد يحتوي تطبيقنا على روابط لمواقع طرف ثالث. نحن لسنا مسؤولين عن ممارسات الخصوصية أو محتوى مواقع الطرف الثالث هذه. 8. التغييرات في سياسة الخصوصية هذه قد نقوم بتحديث سياسة الخصوصية هذه من وقت لآخر. وسوف نقوم بإعلامك بأي تغييرات عن طريق نشر سياسة الخصوصية الجديدة على هذه الصفحة. ننصحك بمراجعة سياسة الخصوصية هذه بشكل دوري لمعرفة أي تغييرات. 9. اتصل بنا إذا كان لديك أي أسئلة أو استفسارات بشأن سياسة الخصوصية هذه، يرجى الاتصال بنا على: [أدخل معلومات الاتصال] 10. خصوصية الأطفال تطبيقنا غير مخصص للاستخدام من قبل الأطفال الذين تقل أعمارهم عن 13 عامًا. نحن لا نجمع معلومات شخصية عن عمد من الأطفال أقل من 13 عامًا. إذا علمت أن طفلًا أقل من 13 عامًا قد زودنا بمعلومات شخصية، فيرجى الاتصال بنا حتى نتمكن من ذلك اتخاذ الإجراءات المناسبة.
fr: 1. Introduction Bienvenue dans l'application Bibliothèque Islamique. Votre vie privée est de la plus haute importance pour nous. Cette politique de confidentialité décrit comment nous collectons, utilisons et protégeons vos informations lorsque vous utilisez notre application. 2. Informations que nous collectons Nous pouvons collecter les types d'informations suivants: ● Informations personnelles : Si vous vous inscrivez pour un compte, nous pouvons collecter votre nom, adresse e-mail et autres coordonnées. ● Données d'utilisation : Nous collectons des informations sur la façon dont vous utilisez notre application, y compris les pages que vous consultez, les fonctionnalités que vous utilisez et les actions que vous entreprenez. ● Données d'appareil : Nous pouvons collecter des informations sur votre appareil, y compris le type, le système d'exploitation et les identifiants uniques de l'appareil. 3. Comment nous utilisons vos informations Nous utilisons les informations que nous collectons aux fins suivantes: ● Pour fournir et améliorer la fonctionnalité et l'expérience utilisateur de notre application. ● Pour communiquer avec vous, y compris l'envoi de mises à jour et de notifications. ● Pour personnaliser votre expérience et fournir du contenu pertinent. ● Pour analyser les modèles d'utilisation et améliorer notre application. 4. Partage de vos informations Nous ne partageons pas vos informations personnelles avec des tiers, sauf dans les cas suivants: ● Avec votre consentement. ● Pour se conformer aux obligations légales. ● Pour protéger et défendre nos droits et biens. ● Avec des fournisseurs de services qui effectuent des services en notre nom (par exemple, les fournisseurs d'hébergement, les outils d'analyse). 5. Sécurité des données Nous mettons en œuvre des mesures techniques et organisationnelles appropriées pour protéger vos données contre l'accès non autorisé, la perte ou la modification. Cependant, veuillez noter qu'aucune mesure de sécurité n'est parfaite ou impénétrable. 6. Vos droits Vous avez les droits suivants concernant vos informations personnelles: ● Accès : Vous pouvez demander l'accès à vos informations personnelles. ● Correction : Vous pouvez demander la correction d'informations incorrectes ou incomplètes. ● Suppression : Vous pouvez demander la suppression de vos informations personnelles. ● Opposition : Vous pouvez vous opposer au traitement de vos informations personnelles. ● Portabilité : Vous pouvez demander le transfert de vos informations personnelles à un tiers. Pour exercer vos droits, veuillez nous contacter à [ajouter e-mail de contact]. 7. Liens vers des tiers Notre application peut contenir des liens vers des sites Web tiers. Nous ne sommes pas responsables des pratiques de confidentialité ou du contenu de ces sites Web tiers. 8. Modifications de cette politique de confidentialité Nous pouvons mettre à jour cette politique de confidentialité de temps à autre. Nous vous informerons de tout changement en publiant la nouvelle politique de confidentialité sur cette page. Nous vous conseillons de consulter périodiquement cette politique de confidentialité pour tout changement. 9. Nous contacter Si vous avez des questions ou des commentaires concernant cette politique de confidentialité, veuillez nous contacter à: [Ajouter les coordonnées] 10. Confidentialité des enfants Notre application n'est pas destinée à être utilisée par des enfants de moins de 13 ans. Nous ne collectons pas sciemment d'informations personnelles auprès d'enfants de moins de 13 ans. Si vous apprenez qu'un enfant de moins de 13 ans nous a fourni des informations personnelles, veuillez nous contacter afin que nous puissions prendre des mesures appropriées.
nl: 1. Inleiding Welkom bij de Islamitische Bibliotheek-app. Uw privacy is van het grootste belang voor ons. Dit privacybeleid beschrijft hoe we uw informatie verzamelen, gebruiken en beschermen wanneer u onze app gebruikt. 2. Informatie die we verzamelen We kunnen de volgende soorten informatie verzamelen: ● Persoonlijke informatie: Als u zich registreert voor een account, kunnen we uw naam, e-mailadres en andere contactgegevens verzamelen. ● Gebruiksgegevens: We verzamelen informatie over hoe u onze app gebruikt, inclusief de pagina's die u bekijkt, de functies die u gebruikt en de acties die u onderneemt. ● Apparaatgegevens: We kunnen informatie verzamelen over uw apparaat, inclusief het type, het besturingssysteem en unieke apparaat-ID's. 3. Hoe we uw informatie gebruiken We gebruiken de informatie die we verzamelen voor de volgende doeleinden: ● Om de functionaliteit en gebruikerservaring van onze app te bieden en te verbeteren. ● Om met u te communiceren, inclusief het verzenden van updates en meldingen. ● Om uw ervaring te personaliseren en relevante inhoud te bieden. ● Om gebruikspatronen te analyseren en onze app te verbeteren. 4. Uw informatie delen We delen uw persoonlijke informatie niet met derden, behalve in de volgende gevallen: ● Met uw toestemming. ● Om te voldoen aan wettelijke verplichtingen. ● Om onze rechten en eigendommen te beschermen en te verdedigen. ● Met serviceproviders die diensten namens ons uitvoeren (bijv. hostingproviders, analysetools). 5. Gegevensbeveiliging We implementeren passende technische en organisatorische maatregelen om uw gegevens te beschermen tegen ongeautoriseerde toegang, verlies of wijziging. Houd er echter rekening mee dat geen enkele beveiligingsmaatregel perfect of ondoordringbaar is. 6. Uw rechten U heeft de volgende rechten met betrekking tot uw persoonlijke informatie: ● Toegang: U kunt toegang vragen tot uw persoonlijke informatie. ● Correctie: U kunt verzoeken om correctie van onjuiste of onvolledige informatie. ● Verwijdering: U kunt verzoeken om verwijdering van uw persoonlijke informatie. ● Bezwaar: U kunt bezwaar maken tegen de verwerking van uw persoonlijke informatie. Om deze rechten uit te oefenen, kunt u contact met ons opnemen via [voeg contact-e-mailadres in]. 7. Links van derden Onze app kan links bevatten naar websites van derden. We zijn niet verantwoordelijk voor de privacypraktijken of de inhoud van deze websites van derden. 8. Wijzigingen in dit privacybeleid We kunnen dit privacybeleid van tijd tot tijd bijwerken. We zullen u op de hoogte stellen van eventuele wijzigingen door het nieuwe privacybeleid op deze pagina te plaatsen. U wordt geadviseerd dit privacybeleid periodiek te herzien op eventuele wijzigingen. 9. Contact opnemen Als u vragen of opmerkingen heeft over dit privacybeleid, kunt u contact met ons opnemen via: [Voeg contactgegevens in] 10. Privacy van kinderen Onze app is niet bedoeld voor gebruik door kinderen onder de 13 jaar. We verzamelen niet bewust persoonlijke informatie van kinderen onder de 13 jaar. Als u zich ervan bewust wordt dat een kind onder de 13 ons persoonlijke informatie heeft verstrekt, neem dan contact met ons op zodat we passende maatregelen kunnen nemen.
ru: 1. Введение Добро пожаловать в приложение Исламская библиотека. Ваша конфиденциальность имеет для нас первостепенное значение. Эта Политика конфиденциальности описывает, как мы собираем, используем и защищаем вашу информацию при использовании нашего приложения. 2. Информация, которую мы собираем Мы можем собирать следующие виды информации: ● Персональная информация: Если вы регистрируетесь для создания аккаунта, мы можем собирать ваше имя, адрес электронной почты и другие контактные данные. ● Данные об использовании: Мы собираем информацию о том, как вы используете наше приложение, включая посещаемые страницы, используемые функции и совершаемые действия. ● Информация об устройстве: Мы можем собирать информацию о вашем устройстве, включая тип, операционную систему и уникальные идентификаторы устройства. 3. Как мы используем вашу информацию Мы используем собранную информацию для следующих целей: ● Для обеспечения и улучшения функциональности и пользовательского опыта нашего приложения. ● Для общения с вами, включая отправку обновлений и уведомлений. ● Для персонализации вашего опыта и предоставления релевантного контента. ● Для анализа моделей использования и улучшения нашего приложения. 4. Распространение вашей информации Мы не передаем вашу личную информацию третьим лицам, за исключением следующих случаев: ● С вашего согласия. ● Для соблюдения юридических обязательств. ● Для защиты и охраны наших прав и собственности. ● С поставщиками услуг, которые предоставляют услуги от нашего имени (например, хостинг-провайдеры, аналитические службы). 5. Безопасность данных Мы внедряем соответствующие технические и организационные меры для защиты ваших данных от несанкционированного доступа, потери или изменения. Однако имейте в виду, что ни одни меры безопасности не являются идеальными или непробиваемыми. 6. Ваши права У вас есть следующие права в отношении вашей личной информации: ● Доступ: Вы можете запросить доступ к своей личной информации. ● Исправление: Вы можете запросить исправление неточной или неполной информации. ● Удаление: Вы можете запросить удаление своей личной информации. ● Возражение: Вы можете возразить против обработки вашей личной информации. Для реализации этих прав, пожалуйста, свяжитесь с нами по адресу [указать контактный email]. 7. Ссылки на сторонние ресурсы Наше приложение может содержать ссылки на сторонние веб-сайты. Мы не несем ответственности за практики конфиденциальности или содержание этих сторонних сайтов. 8. Изменения в этой Политике конфиденциальности Мы можем обновлять эту Политику конфиденциальности время от времени. Мы уведомим вас о любых изменениях, разместив новую Политику конфиденциальности на этой странице. Рекомендуем периодически просматривать эту Политику конфиденциальности на предмет изменений. 9. Связаться с нами Если у вас есть вопросы или обеспокоенности по поводу этой Политики конфиденциальности, пожалуйста, свяжитесь с нами по адресу: [Указать контактную информацию] 10. Конфиденциальность детей Наше приложение не предназначено для использования детьми младше 13 лет. Мы не собираем личную информацию у детей младше 13 лет. Если вам станет известно, что ребенок младше 13 лет предоставил нам свою личную информацию, пожалуйста, свяжитесь с нами, чтобы мы могли принять соответствующие меры.
tr: 1. Giriş İslam Kütüphanesi uygulamasına hoş geldiniz. Gizliliğiniz bizim için son derece önemlidir. Bu Gizlilik Politikası, uygulamamızı kullanırken bilgilerinizi nasıl topladığımızı, kullandığımızı ve koruduğumuzu açıklar. 2. Topladığımız Bilgiler Şu tür bilgileri toplayabiliriz: ● Kişisel Bilgiler: Bir hesap için kaydolursanız, adınızı, e-posta adresinizi ve diğer iletişim bilgilerinizi toplayabiliriz. ● Kullanım Verileri: Uygulamamızı nasıl kullandığınıza dair bilgileri toplarız, buna görüntülediğiniz sayfalar, kullandığınız özellikler ve yaptığınız işlemler dahildir. ● Cihaz Bilgileri: Cihazınız hakkında, türü, işletim sistemi ve benzersiz cihaz tanımlayıcıları gibi bilgileri toplayabiliriz. 3. Bilgilerinizi Nasıl Kullanırız Topladığımız bilgileri şu amaçlarla kullanırız: ● Uygulamamızın işlevselliğini ve kullanıcı deneyimini sağlamak ve geliştirmek. ● Güncellemeler ve bildirimler göndermek dahil sizinle iletişim kurmak. ● Deneyiminizi kişiselleştirmek ve size ilgili içerik sağlamak. ● Kullanım kalıplarını analiz etmek ve uygulamamızı geliştirmek. 4. Bilgilerinizi Paylaşma Kişisel bilgilerinizi üçüncü taraflarla yalnızca şu durumlarda paylaşırız: ● Onayınızla. ● Yasal yükümlülüklere uymak için. ● Haklarımızı ve mülkümüzü korumak ve savunmak için. ● Adımıza hizmet sağlayan hizmet sağlayıcılarla (örneğin, barındırma sağlayıcıları, analiz hizmetleri). 5. Veri Güvenliği Verilerinizi yetkisiz erişim, kayıp veya değişikliklere karşı korumak için uygun teknik ve organizasyonel önlemler uygularız. Ancak, hiçbir güvenlik önleminin mükemmel veya aşılmaz olmadığını lütfen unutmayın. 6. Haklarınız Kişisel bilgilerinizle ilgili şu haklara sahipsiniz: ● Erişim: Kişisel bilgilerinize erişim talep edebilirsiniz. ● Düzeltme: Hatalı veya eksik bilgilerin düzeltilmesini talep edebilirsiniz. ● Silme: Kişisel bilgilerinizin silinmesini talep edebilirsiniz. ● İtiraz: Kişisel bilgilerinizin işlenmesine itiraz edebilirsiniz. Bu hakları kullanmak için lütfen bizimle iletişime geçin [iletişim e-posta adresi ekleyin]. 7. Üçüncü Taraf Bağlantılar Uygulamamız üçüncü taraf web sitelerine bağlantılar içerebilir. Bu üçüncü taraf sitelerin gizlilik uygulamalarından veya içeriğinden sorumlu değiliz. 8. Bu Gizlilik Politikasındaki Değişiklikler Bu Gizlilik Politikasını zaman zaman güncelleyebiliriz. Yeni Gizlilik Politikasını bu sayfada yayınlayarak sizi her türlü değişiklikten haberdar edeceğiz. Bu Gizlilik Politikasını periyodik olarak gözden geçirmenizi tavsiye ederiz. 9. Bizimle İletişime Geçin Bu Gizlilik Politikası hakkında herhangi bir sorunuz veya endişeniz varsa, lütfen bizimle iletişime geçin: [İletişim Bilgilerini Ekleyin] 10. Çocukların Gizliliği Uygulamamız 13 yaş altındaki çocuklar için tasarlanmamıştır. 13 yaş altındaki çocuklardan bilerek kişisel bilgi toplamıyoruz. Eğer 13 yaş altındaki bir çocuğun bize kişisel bilgi sağladığını fark ederseniz, lütfen uygun önlemleri almamız için bizimle iletişime geçin.
ur: 1. معرفت آئیسلامک لائبریری ایپ میں خوش آمدید۔ آپ کی پرائیویسی ہمارے لیے بہت اہم ہے۔ یہ پرائیویسی پالیسی بتاتی ہے کہ ہم آپ کی معلومات کو کیسے جمع کرتے ہیں، استعمال کرتے ہیں اور محفوظ رکھتے ہیں جب آپ ہماری ایپ استعمال کرتے ہیں۔ 2. ہم جمع کرتے ہیں کیا معلومات ہم درج ذیل اقسام کی معلومات جمع کر سکتے ہیں: ● ذاتی معلومات: اگر آپ اکاؤنٹ بنانے کے لیے رجسٹر کرتے ہیں، تو ہم آپ کا نام، ای میل ایڈریس اور دیگر رابطے کی معلومات جمع کر سکتے ہیں۔ ● استعمال کے اعداد و شمار: ہم آپ کی ایپ استعمال کرنے کی معلومات جمع کرتے ہیں، جیسے کہ وزٹ کیے گئے صفحات، استعمال کی جانے والی خصوصیات اور کی جانے والی کارروائیاں۔ ● ڈیوائس کی معلومات: ہم آپ کے ڈیوائس کے بارے میں معلومات جمع کر سکتے ہیں، جیسے کہ قسم، آپریٹنگ سسٹم اور منفرد ڈیوائس شناخت کنندگان۔ 3. ہم آپ کی معلومات کو کیسے استعمال کرتے ہیں ہم جمع کی گئی معلومات کو درج ذیل مقاصد کے لیے استعمال کرتے ہیں: ● ہماری ایپ کی فعالیت اور صارف کے تجربے کو فراہم کرنے اور بہتر بنانے کے لیے۔ ● آپ کے ساتھ بات چیت کرنے کے لیے، بشکل میں اپ ڈیٹ اور اطلاعات بھیجنا۔ ● آپ کے تجربے کو شخصیات بنانا اور آپ کے لیے مواد فراہم کرنا۔ ● استعمال کے نقشے کو تجزیہ کرنا اور ہماری ایپ کو بہتر بنانا۔ 4. آپ کی معلومات کو اشتراک کرنا ہم آپ کی ذاتی معلومات کو تیسری شخصوں کے ساتھ اشتراک نہیں کرتے ہیں صرف درج ذیل صورتوں میں: ● آپ کی رضامندی کے ساتھ۔ ● قانونی ذمہ داریوں کے تحت۔ ● ہمارے حقوق اور جائیداد کی حفاظت اور دفاع کے لیے۔ ● خدمت فراہم کنندگان کے ساتھ جو ہماری بجائے خدمات فراہم کرتے ہیں (مثال کے طور پر ہوسٹنگ فراہم کنندگان، تجزیہ کاری کی خدمات)۔ 5. ڈیٹا کی حفاظت ہم غیر مجاز رسائی، کھو دینے یا تبدیلی کے خلاف اپنی معلومات کی حفاظت کے لیے مناسب تکنیکی اور تنظیماتی اقدامات کو انجام دیتے ہیں۔ ولیکن، براہ کرم اس بات کا علم رکھیں کہ کوئی بھی حفاظتی اقدام مکمل یا غیر محکم نہیں ہوتے۔ 6. آپ کے حقوق آپ کے پرسنل معلومات کے بارے میں آپ کے مندرجہ ذیل حقوق ہیں: ● دسترسی: آپ اپنی ذاتی معلومات تک رسائی کی درخواست کر سکتے ہیں۔ ● اصلاح: آپ غلط یا نا مکمل معلومات کی اصلاح کی درخواست کر سکتے ہیں۔ ● حذف: آپ اپنی ذاتی معلومات کی حذف کی درخواست کر سکتے ہیں۔ ● اعتراض: آپ اپنی ذاتی معلومات کی پراسیسنگ کے خلاف اعتراض کر سکتے ہیں۔ ان حقوق کو استعمال کرنے کیلئے، براہ کرم ہم سے رابطہ کریں: [رابطہ کرنے کی ای میل درج کریں]۔ 7. تیسری شخص کے لنکس ہماری ایپ میں تیسری شخص کی ویب سائٹس کے لنکس ہوسکتے ہیں۔ ہم ان تیسری شخصوں کی پرائیوی پریکٹسز یا مواد کے ذمہ دار نہیں ہیں۔ 8. اس پرائیویسی پالیسی میں تبدیلیاں ہم اس پرائیویسی پالیسی کو وقتاً فوقتاً اپ ڈیٹ کر سکتے ہیں۔ ہم نئی پرائیویسی پالیسی کو اس صفحہ پر پوسٹ کر کے آپ کو کسی بھی تبدیلی کی اطلاع دینے کا وعدہ کرتے ہیں۔ آپ کو مشورہ دیا جاتا ہے کہ آپ اس پرائیویسی پالیسی کو مختصر مدت کے لیے دورانیہ در دورانیہ دیکھیں۔ 9. ہم سے رابطہ کریں اگر آپ کو اس پرائیویسی پالیسی کے بارے میں کوئی سوال یا شکایت ہے، براہ کرم ہم سے رابطہ کریں: [رابطہ کی معلومات درج کریں] 10. بچوں کی پرائیویسی ہماری ایپ کا استعمال 13 سال سے کم عمر کے بچوں کے لیے مقصود نہیں ہے۔ ہم معلومات کا جمع کرنا جانتے ہیں کہ کسی بچہ نے 13 سال سے کم عمر کی عمر میں معلومات فراہم کی ہے، براہ کرم ہم سے رابطہ کریں تاکہ ہم مناسب کارروائی کر سکیں۔

# titleOfTerms
source: Terms of Use for The Islamic Library\nEffective Date: [5/31/2024]\n\n
ar: شروط الاستخدام للمكتبة الإسلامية تاريخ السريان: [31/05/2024]
fr: Conditions d'utilisation de la Bibliothèque Islamique Date d'entrée en vigueur : [31/05/2024]
nl: Gebruiksvoorwaarden voor de Islamitische Bibliotheek\nIngangsdatum: [31/05/2024]\n\n
ru: Условия использования для Исламской библиотеки Дата вступления в силу: [31.05.2024]
tr: İslam Kütüphanesi Kullanım Şartları Yürürlük Tarihi: [31.05.2024]
ur: آئیسلامک لائبریری کے استعمال کے شرائط نافذہ تاریخ: [31/5/2024]
