import 'package:freelancer/config/app_languages.dart';

class Constants{

  static String getTextFamily(String currentLanguage)
  {
    return currentLanguage == Languages.EN.languageCode ? 'Custom': 'ArabicFont';
  }
  static final diacriticsMap = {
    'ٱلصَّلَوٰةَ': 'الصلاة',
    'ٱلصَّلَوٰةِ': 'الصلاة',
    'ٱلزَّكَوٰةَۚ': 'الزكاة',
    'ٱلزَّكَوٰةَِۚ': 'الزكاة',
    'ٰ' : 'ا',
    'أ': 'ا', 'إ': 'ا', 'آ': 'ا', 'إٔ': 'ا', 'إٕ': 'ا', 'إٓ': 'ا',
    'ة': 'ه', 'ٱ': 'ا',
    'ً': '', 'ٌ': '', 'ٍ': '', 'َ': '', 'ُ': '', 'ِ': '', 'ّ': '', 'ْ': '',
    'ٖ': '', 'ٗ': '', 'ٕ': '', 'ٓ': '', 'ٖ': '', 'ٗ': '',
    'ۖ': '', 'ۗ': '', 'ۘ': '', 'ۙ': '', 'ۚ': '', 'ۛ': '', 'ۜ': '', '۝': '',
    '۞': '', '۟': '', '۠': '', 'ۡ': '', 'ۢ': '', 'ۣ': '', 'ۤ': '', 'ۥ': '',
    'ۦ': '', 'ۧ': '', 'ۨ': '', '۩': '', '۪': '', '۫': '', '۬': '', 'ۭ': '',
    'ۮ': '', 'ۯ': '', '۰': '', '۱': '', '۲': '', '۳': '', '۴': '', '۵': '',
    '۶': '', '۷': '', '۸': '', '۹': '', 'ۺ': '', 'ۻ': '', 'ۼ': '', '۽': '',
    '۾': '', 'ۿ': '', '٘': '', 'ٙ': '', 'ٚ': '', 'ٛ': '', 'ٜ': '', 'ٝ': '',
    'ٶ': '', 'ٷ': '', 'ٸ': '', 'ٹ': 'ت', 'ٺ': 'ت', 'ٻ': 'ب', 'ټ': 'ت', 'ٽ': 'ت',
    'پ': 'ب', 'ٿ': 'ت', 'ڀ': 'ب', 'ځ': 'ج', 'ڂ': 'ج', 'ڃ': 'ج', 'ڄ': 'ج', 'څ': 'ج',
    'چ': 'ج', 'ڇ': 'ج', 'ڈ': 'د', 'ډ': 'د', 'ڊ': 'د', 'ڋ': 'د', 'ڌ': 'د', 'ڍ': 'د',
    'ڎ': 'د', 'ڏ': 'د', 'ڐ': 'د', 'ڑ': 'ر', 'ڒ': 'ر', 'ړ': 'ر', 'ڔ': 'ر', 'ڕ': 'ر',
    'ږ': 'ر', 'ڗ': 'ر', 'ژ': 'ز', 'ڙ': 'ر', 'ښ': 'ش', 'ڛ': 'س', 'ڜ': 'ش', 'ڝ': 'ص',
    'ڞ': 'ص', 'ڟ': 'ط', 'ڠ': 'غ', 'ڡ': 'ف', 'ڢ': 'ف', 'ڣ': 'ف', 'ڤ': 'ف', 'ڥ': 'ف',
    'ڦ': 'ف', 'ڧ': 'ق', 'ڨ': 'ق', 'ک': 'ك', 'ڪ': 'ك', 'ګ': 'ك', 'ڬ': 'ك', 'ڭ': 'ك',
    'ڮ': 'ك', 'گ': 'ك', 'ڰ': 'ك', 'ڱ': 'ك', 'ڲ': 'ك', 'ڳ': 'ك', 'ڴ': 'ك', 'ڵ': 'ل',
    'ڶ': 'ل', 'ڷ': 'ل', 'ڸ': 'ل', 'ڹ': 'ن', 'ں': 'ن', 'ڻ': 'ن', 'ڼ': 'ن', 'ڽ': 'ن',
    'ھ': 'ه', 'ڿ': 'ه', 'ۀ': 'ه', 'ہ': 'ه', 'ۂ': 'ه', 'ۃ': 'ه', 'ۄ': 'و', 'ۅ': 'و',
    'ۆ': 'و', 'ۇ': 'و', 'ۈ': 'و', 'ۉ': 'و', 'ۊ': 'و', 'ۋ': 'و', 'ی': 'ي', 'ۍ': 'ي',
    'ێ': 'ي', 'ۏ': 'و', 'ې': 'ي', 'ۑ': 'ي', 'ے': 'ي', 'ۓ': 'ي',
  };

  static String removeDiacritics(String input) {
    diacriticsMap.forEach((key, value) {
      input = input.replaceAll(key, value);
    });
    return input;
  }




}